[["# Choosing a Location for an Oil Well"], ["The dataset contains samples of oil in three regions: in each region, there are 10,000 oil fields where the quality of oil and its volume reserves were measured. The task is to build a machine learning model that will help determine the region where extraction will bring the highest profit. It is necessary to analyze potential profits and risks.\n", "\n", "Steps for choosing a location:\n", "\n", "- In the selected region, we search for oil fields and determine the feature values for each;\n", "- We build a model and estimate the volume of reserves;\n", "- We select the fields with the highest estimated values. The number of fields depends on the company's budget and the cost of developing one well;\n", "- Profit is equal to the cumulative profit from the selected fields."], ["**Data Description**\n", "`id` — unique well identifier  \n", "`f0`, `f1`, `f2` — three feature values of the points  \n", "`product` — volume of reserves in the well (thousand barrels)"], ["## Loading and Preparing the Data"], ["Loading the datasets."], ["Analyzing general information about the data."], ["There are no missing values in the data.   \n", "We need to remove the unnecessary column with data identifiers since they will not be used during model training. If we need the identifiers later, we can restore them using the indices from the original file.   \n", "Features f0, f1, f2 need to be scaled.   \n", "It makes sense to change the data types to lighter ones."], ["### 1.1 Removing the Well ID Column"], ["### 1.2 Checking for Duplicates"], ["### ~~1.3 Scaling the Features~~"], ["This step will be performed during model training."], ["### 1.4 Changing the Data Types"], ["### 1.5 Conclusions"], ["Checking the results"], ["\n", "\n", "**As a result of data preparation:**\n", "   - features with unnecessary information were removed;\n", "   - duplicates and missing values were checked;\n", "   - ~~quantitative features were scaled;~~\n", "   - data types were changed to lighter ones."], ["## 2 Training and Testing the Model"], ["### 2.1 Model Training"], ["Function for training the model and calculating the average predicted oil reserves and RMSE of the model."], ["### 2.2 Analyzing the Results"], ["On segment 2, the RMSE value is the lowest, indicating that the model can make predictions with an order of magnitude higher accuracy compared to segments 1 and 3. On the other hand, the average predicted oil reserves in this segment are lower."], ["## 3 Preparing for Profit Calculation"], [" ### 3.1 Saving All Key Values for Calculations in Separate Variables"], ["### 3.2 Calculating the Sufficient Volume of Oil for Break-Even Development of a New Well. Comparing the Obtained Volume with the Average Reserves in Each Region."], ["The cost of well development is 10 billion.  \n", "The cost per unit volume of oil is 450 thousand rubles.  \n", "We are developing 200 wells, so the expenses per well are 10 billion / 200 = 50 million.  \n", "The sufficient volume for break-even development of a new well is 50 million / 450 thousand = 111.1 units of volume."], [" ### 3.3  Conclusions for the Profit Calculation Preparation Stage"], ["The required volume for break-even development of one new well is 111.1 thousand barrels. The average reserves in each region are insufficient. Particularly in region d_2. Therefore, the probability of making a profit by randomly selecting well locations is low, and machine learning should be used."], ["## 4 Profit Calculation and Risks"], ["### 4.1 Function for Calculating Profit Based on Selected Wells and Model Predictions"], ["Randomly selecting 500 wells out of 25,000 (for our task, it is not necessary to take values from the entire dataset; we can take them from the validation set). The model has already been trained, so we select 500 true values and 500 predicted values."], ["A function that applies bootstrap with 1000 samples to find the profit distribution and calculates the average profit, 95% confidence interval, and risk of losses."], ["### 4.2 Conclusions: Proposed Region for Well Development and Justification for the Choice"], ["The best choice among the three regions is the second region (data stored in the file \"geo_data_1.csv\").  \n", "This region has the lowest risk of losses, 0.9% compared to 5.8% and 8% in the first and third regions, respectively. Moreover, the average predicted profit on the selected 200 wells is higher than in the other areas.  \n", "Based on all significant metrics, the second region is more preferable than the other two."], ["## 5 Conclusions"], ["The following steps were taken during the project: \n", "Data was prepared by removing unnecessary columns, scaling features, and changing data types to lighter ones.  \n", "A linear regression model was trained, and its results were analyzed.  \n", "The required oil reserves in a well for break-even development were calculated.  \n", "The average profit and risk of losses were calculated using the bootstrap method.  \n", "As a result of the analysis, a region for well development was recommended, and justifications for the recommendations were provided."]]